Revit 2027 API
EnergyAnalysisSurface.SurfaceId Property
 The unique identifier for the surface.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string SurfaceId { get; }
Public ReadOnly Property SurfaceId As String
	Get
public:
property String^ SurfaceId {
	String^ get ();
}
member SurfaceId : string with get
Property Value
String
Remarks
 This identification attribute is composed of the prefix "su" and a sequential number, separated by "-". A sample value would be "su-1".
See Also
Reference
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace